emacs-system.org
#+title: System Configuration
#+author: Zhenhua Wang
# #+auto_tangle: t

* MacOS
** Homebrew

#+begin_src shell
brew tap d12frosted/emacs-plus
brew install emacs-plus@29 --with-imagemagick --with-modern-sjrmanning-icon
#+end_src

* Arch Linux
** Gnome
*** Settings
- theme: Orchis
- Cursor: Oreo blue

*** Shell Extension
- Dash to dock for COSMIC
- Unite
- Vitals

** Applications
*** Emacs
#+begin_src shell
git clone git://git.sv.gnu.org/emacs.git
cd emacs
./autogen.sh
./configure --with-dbus \
            --with-jpeg \
            --with-tiff \
            --with-gif \
            --with-png \
            --with-rsvg \
            --with-xwidgets \
            --with-xml2 \
            # --with-native-compilation \
            --with-pgtk
make -j8
sudo make install
#+end_src

*** Latex
#+begin_src shell
yay -S pandoc
yay -S texlive-core
yay -S texlive-latexextra
#+end_src

** System Settings
*** Hibernation
#+begin_src shell
# create swapfile (12G)
dd if=/dev/zero of=/swapfile bs=1M count=12288 status=progress
chmod 0600 /swapfile
mkswap -U clear /swapfile
swapon /swapfile
## edit the fstab (/etc/fstab) configuration to add an entry for the swap file:
/swapfile none swap defaults 0 0
# use hibernator to add resume to kernel parameters
git clone https://github.com/Chrysostomus/hibernator.git
cd hibernator
sudo chmod +x hibernator
./hibernator
# update grub
yay -S update-grub
sudo update-grub
# enable suspend-then-hibernate
## edit /etc/systemd/logind.conf to add the following
HandleLidSwitch=suspend-then-hibernate
## edit HibernateDelaySec in /etc/systemd/sleep.conf
HibernateDelaySec=20min
## restart service
sudo systemctl restart systemd-logind.service
#+end_src

* EXWM
** System setting
*** Xdefaults
color them can be generated by [[http://ciembor.github.io/4bit/#][4bit]]. For terminal, I am using =urxvt=. Note: Keyboard selection is not working properly.
#+begin_src conf :tangle ~/.Xdefaults
! --- ~/.Xresources ------------------------------------------------------------
! ------------------------------------------------------------------------------
! --- generated with 4bit Terminal Color Scheme Designer -----------------------
! ------------------------------------------------------------------------------
! --- http://ciembor.github.com/4bit -------------------------------------------
! ------------------------------------------------------------------------------

! --- special colors ---

,*background: #0d1926
,*foreground: #d9e6f2

! --- standard colors ---

! black
,*color0: #000000

! bright_black
,*color8: #262626

! red
,*color1: #c07273

! bright_red
,*color9: #e0b8b9

! green
,*color2: #73c072

! bright_green
,*color10: #b9e0b8

! yellow
,*color3: #c0bf72

! bright_yellow
,*color11: #e0dfb8

! blue
,*color4: #7273c0

! bright_blue
,*color12: #b8b9e0

! magenta
,*color5: #bf72c0

! bright_magenta
,*color13: #dfb8e0

! cyan
,*color6: #72c0bf

! bright_cyan
,*color14: #b8e0df

! white
,*color7: #d9d9d9

! bright_white
,*color15: #ffffff


! ------------------------------------------------------------------------------
! --- end of terminal colors section -------------------------------------------
! ------------------------------------------------------------------------------


URxvt.termName: rxvt
URxvt.transparent: true
URxvt.inheritPixmap: False
URxvt.scrollBar: false
URxvt.saveLines: 500
URxvt.urlLauncher:      qutebrowser
URxvt.cursorBlink: true
URxvt.fading: 25%
urxvt.font:             xft:JetBrainsMono Nerd Font:pixelsize=30
urxvt.boldFont:         xft:JetBrainsMono Nerd Font:bold:pixelsize=30
URxvt*background:      #303030
urxvt.depth: 32
urxvt.background: rgba:0000/0000/0000/bbbb
URxvt.foreground: grey80
URxvt.tintColor: #262626
URxvt.borderColor: #888888

! keybindings
URxvt.keysym.M-w: eval:selection_to_clipboard
URxvt.keysym.C-y: eval:paste_clipboard
URxvt.keysym.Control-Left:        \033[1;5D
URxvt.keysym.Shift-Control-Left:  \033[1;6D
URxvt.keysym.Control-Right:       \033[1;5C
URxvt.keysym.Shift-Control-Right: \033[1;6C
URxvt.keysym.Control-Up:          \033[1;5A
URxvt.keysym.Shift-Control-Up:    \033[1;6A
URxvt.keysym.Control-Down:        \033[1;5B
URxvt.keysym.Shift-Control-Down:  \033[1;6B
#+end_src

** System Applications
*** MPV -- video player
+ MPV
+ youtube-dl is used to watch youtube
+ streamlink is used to watch streams
+ mpv-mpris & playerctl allow playback control
  eg. ~streamlink huya.com/405945 source_bd --player mpv~
*** ROFI -- app drawer
#+begin_src conf :tangle ~/.config/rofi/config.rasi
configuration {
  display-run: " ";
  display-filebrowser: "  ";
  display-ssh     : " ";
  display-drun    : " ";
  display-window  : " ";
  drun-display-format: "{icon} {name}";
  font: "JetBrainsMono Nerd Font 24";
  modi: "drun,power-menu:rofi-power-menu,filebrowser";
  matching: "fuzzy";
  show-icons: true;
  kb-mode-next: "super+Tab";
  kb-mode-previous: "super+shift+Tab";
}

 ,* {
    bg-color: #242424E6;
    fg-color: #DEDEDE;
    tooltip-fg-color: #7E7E7E;
    selected-bg-color: #0860f2E6;
    selected-fg-color: #FFFFFF;
    insensitive-bg-color: #7E7E7E80;
    insensitive-fg-color: #7E7E7E;

    text-color          : @fg-color;
}
#window {
    location            : center;
    y-offset            : -200;
    width               : 1200;
    border-radius       : 8;
    background-color    : @bg-color;
}
#mainbox {
    spacing             : 0;
    background-color    : transparent;
}
#inputbar {
    font                : "JetBrainsMono Nerd Font 24";
    background-color    : transparent;
}
#prompt {
    text-color          : @tooltip-fg-color;
    font                : inherit;
    background-color    : inherit;
    margin              : 16 16 24 20;
}
#entry {
    font                : inherit;
    background-color    : inherit;
    placeholder         : "Search";
    placeholder-color   : @insensitive-fg-color;
    margin              : 11 0;
    text-color          : @tooltip-fg-color;
}
#case-indicator {
    margin              : 8 8 8 24;
    font                : inherit;
    background-color    : inherit;
}
#message {
    padding             : 0;
    border              : 2 0 0;
    border-color        : @insensitive-bg-color;
    background-color    : @insensitive-bg-color;
}
#textbox {
    padding             : 8 24;
    background-color    : inherit;
}
#listview {
    lines               : 10;
    columns             : 1;
    fixed-height        : false;
    spacing             : 0;
    scrollbar           : false;
    background-color    : transparent;
    border              : 2 0 0;
    border-color        : @insensitive-bg-color;
}
#element {
    padding             : 8 24;
    background-color    : transparent;
}
#element normal normal {
    background-color    : inherit;
    text-color          : inherit;
}
element.alternate.normal {
    background-color    : inherit;
    text-color          : inherit;
}
#element normal urgent {
}
#element normal active {
    text-color          : @selected-bg-color;
}
#element selected normal {
    background-color    : @selected-bg-color;
    text-color          : @selected-fg-color;
}
#element selected urgent {
}
#element selected active {
    background-color    : @selected-bg-color;
    text-color          : @selected-fg-color;
}
#element-icon {
    size                : 1em;
    margin              : 0 16 0 0;
}
element-text, element-icon {
    background-color: inherit;
    text-color:       inherit;
}
#+end_src

*** Polybar -- menu bar
#+begin_src conf :tangle ~/.config/polybar/config
[settings]
screenchange-reload = true

[global/wm]
margin-top = 0
margin-bottom = 0

[colors]
;; dark theme
background =            #fe282b33
background-alt =        #1f2024

foreground =            #FFFFFF
foreground-alt =        #FFFFFF
; foreground =            #c6c6c6
; foreground-alt =        #c9d9ff

;; other colors
red =                   #bf616a
green =                 #a3be8c
yellow =                #ebcb8b
blue =                  #5e81ac
magenta =               #b48ead
cyan =                  #88c0d0
white =                 #eceff4
gray =                  #4c566a
black =                 #2e3440

[bar/panel]
bottom = false
width = 100%
height = 42
offset-x = 0
offset-y = 0
fixed-center = true
enable-ipc = true

background = ${colors.background}
foreground = ${colors.foreground}

line-size = 2
line-color = #f00

border-size = 0
border-color = #00000000


padding-top = 5
padding-left = 4px
padding-right = 2px

module-margin-left = 1
module-margin-right = 1

font-0 = "Cantarell:size=18:weight=bold;2"
font-1 = "Font Awesome:size=16;2"
font-2 = "Material Icons:size=16;5"
font-3 = "JetBrainsMono Nerd Font:size=16;2"
font-4 = "SourceHanSansCN:size=16"


modules-left = exwm-workspace
modules-center = date
modules-right = temperature battery

; tray-position = none
tray-position = right
tray-padding = 2
tray-maxsize = 28

cursor-click = pointer
cursor-scroll = ns-resize

[module/exwm-workspace]
type = custom/ipc

; hook-0 = emacsclient -e "(exwm/polybar-exwm-workspace-chinese)" | sed -e 's/^"//' -e 's/"$//' | awk '{print "  "$1"  "}'
hook-0 = emacsclient -e "exwm-workspace-current-index" | sed -e 's/^"//' -e 's/"$//' | awk '{print "   "$1"   "}'
initial = 1
format-padding = 1
format-background = ${colors.background-alt}

[module/memory]
type = internal/memory

interval = 5

format =   <label>
format-foreground = ${colors.foreground}

label = %percentage_used%%

[module/cpu]
type = internal/cpu
interval = 2

format = ﬙  <label> <ramp-coreload>
click-left = emacsclient -e "(proced)"
label = %percentage:2%%
format-padding = 1
; Spacing between individual per-core ramps
ramp-coreload-spacing = 0
ramp-coreload-0 = ▁
ramp-coreload-1 = ▂
ramp-coreload-2 = ▃
ramp-coreload-3 = ▄
ramp-coreload-4 = ▅
ramp-coreload-5 = ▆
ramp-coreload-6 = ▇
ramp-coreload-7 = █

[module/temperature]
type = internal/temperature
thermal-zone = 0
interval = 0.5
base-temperature = 20
warn-temperature = 60

format = <ramp> <label>
format-foreground = ${colors.foreground}
format-padding = 1

format-warn = <label-warn>
format-warn-foreground = ${colors.red}
format-warn-padding = 1

label = "%temperature-c%"
label-warn = "%temperature-c%!"
label-warn-foreground = ${colors.red}

ramp-0 = 
ramp-0-foreground = ${colors.blue}
ramp-1 = 
ramp-1-foreground = ${colors.yellow}
ramp-2 = 
ramp-2-foreground = ${colors.red}

[module/date]
type = internal/date
interval = 5

date = "%a %b %e"
date-alt = "%A %B %d %Y"

time = %l:%M %p
time-alt = %H:%M:%S

format-prefix-foreground = ${colors.foreground-alt}

label = %date% - %time%
; label =  %date% -  %time%
format = <label>
format-padding = 3

[module/battery]
type = internal/battery
battery = BAT0
adapter = ADP1
full-at = 98
time-format = %-l:%M

label-charging = %percentage%%
format-charging = <animation-charging> <label-charging>
format-charging-prefix = " "
; format-charging-prefix-foreground = ${color.red}

label-discharging = %percentage%%
format-discharging = <ramp-capacity> <label-discharging>


format-full = <label-full>
format-full-prefix = " "
; format-full-foreground = ${colors.green}


ramp-capacity-0 = 
ramp-capacity-1 = 
ramp-capacity-2 = 
ramp-capacity-3 = 
ramp-capacity-4 = 
ramp-capacity-5 = 
ramp-capacity-6 = 
ramp-capacity-7 = 
ramp-capacity-8 = 
ramp-capacity-9 = 
ramp-capacity-10 = 
ramp-capacity-foreground = ${colors.foreground}

animation-charging-0 = 
animation-charging-1 = 
animation-charging-2 = 
animation-charging-3 = 
animation-charging-4 = 
animation-charging-5 = 
animation-charging-6 = 
animation-charging-7 = 
animation-charging-8 = 
animation-charging-9 = 
animation-charging-10 = 
; animation-charging-foreground = ${colors.green}
animation-charging-framerate = 500

[module/pulseaudio]
type = internal/pulseaudio
sink = alsa_output.pci-0000_12_00.3.analog-stereo
use-ui-max = true

interval = 5

format-volume = <ramp-volume> <label-volume>

format-muted = <label-muted>
label-muted = 婢
label-muted-foreground = #666

ramp-volume-0 = 奄
ramp-volume-1 = 奔
ramp-volume-2 = 墳

click-right = pavucontrol

[module/powermenu]
type = custom/menu

format-spacing = 3
label-open = "    "
format-open-padding = 1
label-open-foreground = ${colors.cyan}
; label-close = 
; label-close-foreground = ${colors.red}
; label-separator = |
; label-separator-foreground = ${colors.foreground-alt}

; menu-0-0 = 
; menu-0-0-exec = menu-open-1
; menu-0-1 = 
; menu-0-1-exec = menu-open-2
; menu-0-2 = 
; menu-0-2-exec = menu-open-3

; menu-1-0 = 
; menu-1-0-exec = systemctl reboot

; menu-2-0 = 
; menu-2-0-exec = systemctl poweroff

; menu-3-0 = 
; menu-3-0-exec = systemctl suspend
#+end_src

