emacs-system.org
*** okular -- reader
To show icons in okular, you need to install breeze-icons
#+begin_src conf :tangle ~/.local/share/kxmlgui5/okular/part.rc
<?xml version='1.0'?>
<!DOCTYPE gui SYSTEM 'kpartgui.dtd'>
<gui version="49" name="okular_part">
 <MenuBar>
  <Menu name="file">
   <text>&amp;File</text>
   <Action name="get_new_stuff" group="file_open"/>
   <Action name="import_ps" group="file_open"/>
   <Action name="file_save" group="file_save"/>
   <Action name="file_save_as" group="file_save"/>
   <Action name="file_reload" group="file_save"/>
   <Action name="file_print" group="file_print"/>
   <Action name="file_print_preview" group="file_print"/>
   <Action name="open_containing_folder" group="file_print"/>
   <Action name="properties" group="file_print"/>
   <Action name="embedded_files" group="file_print"/>
   <Action name="file_export_as" group="file_print"/>
   <Action name="file_share" group="file_print"/>
  </Menu>
  <Menu name="edit">
   <text>&amp;Edit</text>
   <Action name="edit_undo"/>
   <Action name="edit_redo"/>
   <Separator/>
   <Action name="edit_copy"/>
   <Separator/>
   <Action name="edit_select_all"/>
   <Action name="edit_select_all_current_page"/>
   <Separator/>
   <Action name="edit_find"/>
   <Action name="edit_find_next"/>
   <Action name="edit_find_prev"/>
  </Menu>
  <Menu name="view">
   <text>&amp;View</text>
   <Action name="presentation"/>
   <Separator/>
   <Action name="view_zoom_in"/>
   <Action name="view_zoom_out"/>
   <Action name="view_actual_size"/>
   <Action name="view_fit_to_width"/>
   <Action name="view_fit_to_page"/>
   <Action name="view_auto_fit"/>
   <Separator/>
   <Action name="view_render_mode"/>
   <Separator/>
   <Menu name="view_orientation">
    <text>&amp;Orientation</text>
    <Action name="view_orientation_rotate_ccw"/>
    <Action name="view_orientation_rotate_cw"/>
    <Action name="view_orientation_original"/>
   </Menu>
   <Action name="view_trim_mode"/>
   <Separator/>
   <Action name="view_toggle_forms"/>
  </Menu>
  <Menu name="go">
   <text>&amp;Go</text>
   <Action name="go_previous"/>
   <Action name="go_next"/>
   <Separator/>
   <Action name="first_page"/>
   <Action name="last_page"/>
   <Separator/>
   <Action name="go_document_back"/>
   <Action name="go_document_forward"/>
   <Separator/>
   <Action name="go_goto_page"/>
  </Menu>
  <Menu name="bookmarks">
   <text>&amp;Bookmarks</text>
   <Action name="bookmark_add"/>
   <Action name="rename_bookmark"/>
   <Action name="previous_bookmark"/>
   <Action name="next_bookmark"/>
   <Separator/>
   <ActionList name="bookmarks_currentdocument"/>
  </Menu>
  <Menu name="tools">
   <text>&amp;Tools</text>
   <Action name="mouse_drag"/>
   <Action name="mouse_zoom"/>
   <Action name="mouse_select"/>
   <Action name="mouse_textselect"/>
   <Action name="mouse_tableselect"/>
   <Action name="mouse_magnifier"/>
   <Separator/>
   <Action name="mouse_toggle_annotate"/>
   <Separator/>
   <Action name="add_digital_signature"/>
   <Separator/>
   <Action name="speak_document"/>
   <Action name="speak_current_page"/>
   <Action name="speak_stop_all"/>
   <Action name="speak_pause_resume"/>
  </Menu>
  <Menu name="settings">
   <text>&amp;Settings</text>
   <Action name="show_leftpanel" group="show_merge"/>
   <Action name="show_bottombar" group="show_merge"/>
   <Action name="options_configure_generators" group="configure_merge"/>
   <Action name="options_configure" group="configure_merge"/>
  </Menu>
  <Menu name="help">
   <text>&amp;Help</text>
   <Action name="help_about_backend" group="about_merge"/>
  </Menu>
 </MenuBar>
 <ToolBar name="mainToolBar">
  <text>Main Toolbar</text>
  <Action name="show_leftpanel"/>
  <Separator/>
  <Action name="mouse_drag"/>
  <Action name="mouse_selecttools"/>
  <Action name="annotation_favorites"/>
  <Spacer/>
  <Action name="page_number"/>
  <Spacer/>
  <Action name="view_zoom_out"/>
  <Action name="zoom_to"/>
  <Action name="view_zoom_in"/>
 </ToolBar>
 <ToolBar iconText="icononly" hidden="true" name="annotationToolBar" newline="true">
  <text>Annotation Toolbar</text>
  <Action name="annotation_highlighter"/>
  <Action name="annotation_underline"/>
  <Action name="annotation_squiggle"/>
  <Action name="annotation_strike_out"/>
  <Action name="annotation_typewriter"/>
  <Action name="annotation_inline_note"/>
  <Action name="annotation_popup_note"/>
  <Action name="annotation_freehand_line"/>
  <Action name="annotation_geometrical_shape"/>
  <Action name="annotation_stamp"/>
  <Separator/>
  <Action name="annotation_settings_width"/>
  <Action name="annotation_settings_color"/>
  <Action name="annotation_settings_inner_color"/>
  <Action name="annotation_settings_opacity"/>
  <Action name="annotation_settings_font"/>
  <Action name="annotation_settings_advanced"/>
  <Separator/>
  <Action name="annotation_bookmark"/>
  <Action name="annotation_settings_pin"/>
  <Spacer/>
  <Action name="hide_annotation_toolbar"/>
 </ToolBar>
 # keybindings
 <ActionProperties scheme="Default">
  <Action priority="0" name="show_leftpanel"/>
  <Action shortcut="Alt+W" name="edit_copy"/>
  <Action shortcut="Meta+Shift+Z" name="edit_redo"/>
  <Action shortcut="Meta+Z" name="edit_undo"/>
  <Action shortcut="Meta+R" name="file_reload"/>
  <Action shortcut="Meta+S" name="file_save"/>
  <Action shortcut="Meta+Shift+S" name="file_save_as"/>
  <Action name="go_next" shortcut="Ctrl+V"/>
  <Action name="go_previous" shortcut="Alt+V"/>
  <Action priority="0" name="mouse_drag"/>
  <Action priority="0" name="annotation_favorites"/>
  <Action priority="0" name="mouse_selecttools"/>
  <Action priority="0" name="view_zoom_out"/>
  <Action priority="0" name="view_zoom_in"/>
  <Action shortcut="Ctrl+S" name="edit_find"/>
 </ActionProperties>
</gui>
#+end_src

*** pass -- passward manager
This is unsecure as the passwd will stay on your clipboard
#+begin_src emacs-lisp :tangle "yes"
(defun zw/get-passwd (id)
  (interactive "MEnter your id: ")
  ;; (kill-new (shell-command-to-string (concat "pass " id)))
  (let ((proc (start-process-shell-command "pass" nil (concat "pass " id))))
    ;; async parse process' output
    (set-process-filter proc (lambda (proc line)
                               (progn
                                 (kill-new line)
                                 (message "pwd copied"))))))

;; not working now..
(defun zw/insert-passwd (id)
  (interactive "MEnter your id: ")
  (start-process-shell-command "pass" nil (concat "pass insert " id))
  ;; (call-process-shell-command "pass" nil (concat "pass -c " id))
  (message (concat id " pwd inserted!!"))
)
#+end_src

*** librime -- chinese input

+ user setting
#+begin_src conf :tangle ~/.config/rime/default.custom.yaml
patch:
  schema_list:
    - schema: luna_pinyin_simp
patch:
  "menu/page_size": 9

'speller/algebra':
    - erase/^xx$/                      # 第一行保留

    # 模糊音定義
    - derive/^([zcs])h/$1/             # zh, ch, sh => z, c, s
    - derive/^([zcs])([^h])/$1h$2/     # z, c, s => zh, ch, sh

    - derive/^n/l/                     # n => l
    - derive/^l/n/                     # l => n

    # 這兩組一般是單向的
    #- derive/^r/l/                     # r => l

    - derive/^ren/yin/                 # ren => yin, reng => ying
    #- derive/^r/y/                     # r => y

    # 下面 hu <=> f 這組寫法複雜一些，分情況討論
    #- derive/^hu$/fu/                  # hu => fu
    #- derive/^hong$/feng/              # hong => feng
    #- derive/^hu([in])$/fe$1/          # hui => fei, hun => fen
    #- derive/^hu([ao])/f$1/            # hua => fa, ...

    #- derive/^fu$/hu/                  # fu => hu
    #- derive/^feng$/hong/              # feng => hong
    #- derive/^fe([in])$/hu$1/          # fei => hui, fen => hun
    #- derive/^f([ao])/hu$1/            # fa => hua, ...

    # 模糊音定義先於簡拼定義，方可令簡拼支持以上模糊音
    - abbrev/^([a-z]).+$/$1/           # 簡拼（首字母）
    - abbrev/^([zcs]h).+$/$1/          # 簡拼（zh, ch, sh）

    # 自動糾正一些常見的按鍵錯誤
    - derive/([aeiou])ng$/$1gn/        # dagn => dang
    - derive/([dtngkhrzcs])o(u|ng)$/$1o/  # zho => zhong|zhou
    - derive/ong$/on/                  # zhonguo => zhong guo
    - derive/ao$/oa/                   # hoa => hao
    - derive/([iu])a(o|ng?)$/a$1$2/    # tain => tian

translator/dictionary: luna_pinyin.extended
#+end_src
+ luna pinyin
#+begin_src conf :tangle ~/.config/rime/luna_pinyin.custom.yaml
patch:
  switches:                   # 注意缩进
    - name: ascii_mode
      reset: 0                # reset 0 的作用是当从其他输入法切换到本输入法重设为指定状态
      states: [ 中文, 西文 ]   # 选择输入方案后通常需要立即输入中文，故重设 ascii_mode = 0
    - name: full_shape
      states: [ 半角, 全角 ]   # 而全／半角则可沿用之前方案的用法。
    - name: simplification
      reset: 1                # 增加这一行：默认启用「繁→簡」转换。
      states: [ 漢字, 汉字 ]
#+end_src
*** ibus-rime -- chinese input
+ Anaconda python would raise error about =gi= and =gtkx11= runing ~ibus-setup~, so you need to switch to system python
#+begin_src conf :tangle "no"
export PATH=/usr/bin:$PATH
#+end_src
+ modify env
#+begin_src emacs-lisp :tangle "no"
;; use ibus-rime for X11 apps
(setenv "GTK_IM_MODULE" "ibus")
(setenv "QT_IM_MODULE" "ibus")
(setenv "XMODIFIERS" "@im=ibus")
#+end_src
+ 转为简体
https://blog.csdn.net/chougu3652/article/details/100656237
+ qt光标不跟随 -- 这是因为我用xrandr调了dpi
*** picom -- screen compositor
#+begin_src conf :tangle  ~/.config/picom.conf
opacity-rule = [
  "90:class_g = 'URxvt' && focused",
  "40:class_g = 'URxvt' && !focused",
];

blur: {
      method = "dual_kawase";
      strength = 10;
      background = false;
      background-frame = false;
      background-fixed = false;
}
#+end_src

*** bcwc pcie -- macbook facetime camera
install from aur: ~yay -S bcwc-pcie-git~
Run depmod for kernel to be able to find and load it: ~sudo depmod~
Load kernel module: ~sudo modprobe facetimehd~

*** TODO libreoffice
** Fonts
*** noto-fonts-emoji -- emoji
this package is useful for displaying emoji in x windows
* Provide System Conf
#+begin_src emacs-lisp :tangle "yes"
(provide 'emacs-system)
#+end_src
